#Задача 8
A=input('Введите число A ')
B=input('Введите число B ')
A=int(A)
B=int(B)
if A<B:
    print(A)
else:
    print(B)
