#Задача 1
belki=input('Введите количество белок ')
orehi=input('Введите количество орехов ')
belki=int(belki)
orehi=int(orehi)
itog=orehi//belki
print(itog)
