#Задача 11
#На всякий случай
t=input('Введите температуру в комнате в Градусах Цельсия ')
t=int(t)
t=t*1.8+32
print(t)
