#Задача 6
N=input('Введите целое неотрицательное число ')
N=int(N)
print(pow(3,N))
